# Assignment 2 - Pandas

### Q1.	Import the attached Netflix csv file in Jupyter notebook and perform following operations using Pandas:

In [237]:
#checking current working directory
import os
os.getcwd()

'C:\\Anitha_official\\DataScience_IITG\\Assignments_and_Projects\\Assignments\\Pandas'

In [ ]:
import pandas as pd
# import csv file into jupyter notebook
df_netflix = pd.read_csv("netflix.csv")

In [ ]:
# a) Print the first 5 rows and last 5 rows of the dataframe
df_netflix.head(5) # first 5 rows
df_netflix.tail(5) # last 5 rows

In [ ]:
# b) Check how many rows and columns are there using Pandas function.
df_netflix.shape

In [ ]:
#c)	Print all the column names.
df_netflix.columns # print column names
df_netflix.info()  # print data type of each column

In [ ]:
#d)	Calculate the descriptive statistics of all the variables(integer/float/object etc).
df_netflix.describe(include ='all') #for descriptive statistics

In [ ]:
# e)	Check the number of unique values for each column.
col_names = df_netflix.columns
n_unqs = []
for i in range(0,len(col_names)):
    unqs = df_netflix[df_netflix.columns[i]].nunique()          # finding unique values in each column
    n_unqs.append(unqs)
#print(n_unqs)
data = {'col_names':col_names,'unique_values':n_unqs}
df_unqs = pd.DataFrame(data)
print(df_unqs)

In [ ]:
#f)	Check the percentage of missing values# for each column.
missings= pd.DataFrame((df_netflix.isnull().sum()/len(df_netflix))*100)
missings.columns = ['missing_percentage']
missings['missing_percentage'] = round(missings['missing_percentage'],2)
missings['missing_percentage']= missings['missing_percentage'].astype('str')
missings['missing_percentage'] = missings['missing_percentage']+"%"
missings.index_name = 'column_names'
missings = missings.reset_index(names = 'column_names')
missings

In [241]:
#g)	Delete all the rows where Director column has missing values.
df_dirctor_rm = df_netflix.dropna(subset = ['director'],inplace = False)

In [ ]:
# h)Print all the records where country has Germany value (including West Germany). 
#If any other country is there along with Germany, then that row should also come in output.

df_Germany = df_netflix[df_netflix['country'].str.contains('Germany',case = False, na = False)]
df_Germany['country'].value_counts()

In [3]:
#i)	Expand Duration column into 2 separate columns – First column having the numeric value and other having String. 
#Eg: 3 seasons should be split in 2 columns having 3 in 1st column and seasons in 2nd column.

df_netflix[['duration_numeric','duration_other']] = df_netflix['duration'].str.split(' ',n = 1,expand = True)

In [ ]:
#j)	Split Date added into 3 separate columns having date value in 1st column, month value in 2nd column and year value in 3rd.
df_netflix['date_added'].head(5)
df_netflix.info()

import pandas as pd
import warnings

# Ignore warnings
warnings.filterwarnings('ignore')

# Convert to datetime safely (handles mixed formats automatically)
df_netflix['date_added'] = pd.to_datetime(df_netflix['date_added'], errors='coerce', infer_datetime_format=True)

# Split into day, month, and year columns
df_netflix['day_added'] = df_netflix['date_added'].dt.day
df_netflix['month_added'] = df_netflix['date_added'].dt.month
df_netflix['year_added'] = df_netflix['date_added'].dt.year

# Verify the result
print(df_netflix[['date_added', 'day_added', 'month_added', 'year_added']].head())

In [ ]:
#k)	Print the number of TV shows/Movies released in each year.
df_netflix.head(5)
df_netflix.groupby(['release_year','type'])['show_id'].count()

In [ ]:
#l)	Rename the column title with movie_title.
df_netflix.rename(columns = {'title':'movie_title'})

In [ ]:
#m)	Split Listed_in column into 3 different columns with col name (Genre1, Genre2, Genre3). Split the column based on comma.

#Use str.split with expand=True to create a DataFrame, then limit to 3 columns
split_genres = df_netflix['listed_in'].str.split(',', expand=True).iloc[:, :3]

# Rename the columns
split_genres.columns = ['Genre1', 'Genre2', 'Genre3']

# Join the new columns back to the original DataFrame
df_netflix = pd.concat([df_netflix, split_genres], axis=1)

# Q2. Import both the attached files (student.csv and marks.csv) in Jupyter notebook and perform following operations

In [36]:
import pandas as pd
df_student = pd.read_csv("student.csv")
df_marks = pd.read_csv("mark.csv")

In [136]:
df_student.head(5)

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [137]:
df_marks.head(5)

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

In [138]:
# a)Combine both the dataframes into single dataframe which will have all the records from 
# both the tables
df_student_marks = pd.merge(df_student, df_marks, on='Student_id', how = 'outer')

In [139]:
print(df_student.shape)
print(df_marks.shape)
print(df_student_marks.shape)
#df_student_marks.head(5)

(232, 5)
(229, 3)
(232, 7)

In [140]:
# b)	Print the maximum and minimum marks Gender wise.
#df_student_marks['Mark'] = df_student_marks['Mark'].fillna(0)
df_student_marks.groupby(['Gender']).agg({'Mark':['min','max']})

        Mark
         min    max
Gender
Female  40.0   99.0
Male    40.0  100.0

In [141]:
# c)	Print all the students IDs and their marks who have scored more than the average marks of the class.
avg_marks = df_student_marks['Mark'].mean()
above_avg_students = df_student_marks[df_student_marks['Mark']>avg_marks][['Student_id','Mark']]

In [142]:
# d) Print the dataframe who are Males and are Employed
Employed_marks = df_student_marks[(df_student_marks['Gender'] == 'Male') & (df_student_marks['Employed'] == 'yes')]

In [143]:
# e) Create a new Column ‘IQ_level’ which will have 3 values (Intelligent, Mediocre, weak).
# If student scored than 80 then Tag him as Intelligent, if student scored between 50-80, then Mediocre,
# else weak.

df_student_marks['IQ_Level'] = df_student_marks.apply(lambda x: 'Intelligent' if x['Mark'] > 80 
                                                     else ('Mediocre' if 50 < x['Mark'] < 80 
                                                          else 'weak'), axis=1)

In [106]:
df_student_marks.columns

Index(['Student_id', 'Age', 'Gender', 'Grade', 'Employed', 'Mark', 'City'], dtype='object')

In [120]:
# f) Count the number of males and females from each city.
df_student_marks.groupby(['Gender','City'])['Student_id'].count()

Gender  City
Female  Bhopal     13
        Chennai    15
        Delhi      12
        Gwalior    14
        Kochi      10
        Mumbai     16
        Pune       15
Male    Bhopal     15
        Chennai    18
        Delhi      20
        Gwalior    18
        Kochi      21
        Mumbai     16
        Pune       26
Name: Student_id, dtype: int64

In [122]:
# g)	Print the top 5 Male scorers.
#df_student_marks.columns
top5_males = (
    df_student_marks[df_student_marks['Gender'] == 'Male']  # filter males
    .sort_values(by='Mark', ascending=False)               # sort by Marks descending
    .head(5)                                                # take top 5
)

print(top5_males)

     Student_id  Age Gender      Grade Employed  Mark     City     IQ_Level
146         150   19   Male  1st Class       no   100   Bhopal  Intelligent
144         148   18   Male  1st Class       no    99    Kochi  Intelligent
59           63   19   Male  1st Class       no    98  Chennai  Intelligent
57           61   18   Male  1st Class       no    98  Gwalior  Intelligent
2             3   18   Male  1st Class       no    98   Mumbai  Intelligent

In [123]:
# h) Replace the Male value with M and Female value with F and export this dataframe to excel file in D: (D drive) and name the file as test.csv.

# Replace 'Male' → 'M' and 'Female' → 'F'
df_student_marks['Gender'] = df_student_marks['Gender'].replace({'Male': 'M', 'Female': 'F'})

# Export to Excel file in D: drive
df_student_marks.to_excel(r'D:\test.xlsx', index=False)

print("File 'test.xlsx' has been successfully saved in D: drive.")

File 'test.xlsx' has been successfully saved in D: drive.

In [128]:
# i)	Check if any student_ID is duplicated.
dups = df_student_marks['Student_id'].duplicated().any()
print(dups)

False

In [129]:
# j) Create a separate dataframe which will have all the Integer/Float variables.
# Select only numeric columns (int or float)
df_numeric = df_student_marks.select_dtypes(include=['int64', 'float64'])
print(df_numeric.head())

   Student_id  Age  Mark
0           1   19    95
1           2   20    70
2           3   18    98
3           4   21    75
4           5   19    89

In [133]:
# k) Get those Student_IDs which are present in Students table but not in Marks table.
missing_ids_data = df_student[~df_student['Student_id'].isin(df_marks['Student_id'])]
print(missing_ids_data)
#only the IDs (not full rows)
missing_ids = df_student.loc[~df_student['Student_id'].isin(df_marks['Student_id']), 'Student_id']
print(missing_ids)

    Student_id  Age  Gender      Grade Employed
8            9   22  Female  3rd Class      yes
9           10   21    Male  1st Class       no
48          49   19    Male  2nd Class       no
8      9
9     10
48    49
Name: Student_id, dtype: int64

### 3.	Explain the concept of missing values. How can you identify the missing values in a Pandas DataFrame ? What are the different ways of treating/Imputing/Deleting the missing values.Explain with example.

#### 
Ans: Missing values are incomplete data points that must be handled carefully. We can identify them using isnull() and handle them using dropna() or fillna() depending on data context.

In [145]:
# ---------------------------------------------
# Missing Values in Pandas – Complete Example
# ---------------------------------------------

import pandas as pd
import numpy as np

# ---------------------------
# 1️. Create Sample DataFrame
# ---------------------------
df = pd.DataFrame({
    'Student_id': [1, 2, 3, 4, 5],
    'Name': ['Jay', 'Eric', 'Amit', np.nan, 'Saranya'],
    'Marks': [85, np.nan, 75, 90, np.nan],
    'City': ['Delhi', 'Mumbai', None, 'Pune', 'Hyderabad']
})

print("Original DataFrame:\n", df, "\n")

# ------------------------------------------
# 2️. Identify Missing Values
# ------------------------------------------
print("Check missing values using isnull():\n", df.isnull(), "\n")
print("Count of missing values in each column:\n", df.isnull().sum(), "\n")
print("Non-null info summary:\n")
df.info()
print("\n")

# ------------------------------------------
# 3️. Handle Missing Values – Deletion
# ------------------------------------------

# Drop rows with any missing values
df_drop_rows = df.dropna()
print("After dropping rows with missing values:\n", df_drop_rows, "\n")

# Drop columns with missing values
df_drop_cols = df.dropna(axis=1)
print("After dropping columns with missing values:\n", df_drop_cols, "\n")

# Drop rows only if all values are missing
df_drop_all = df.dropna(how='all')
print("After dropping rows where all values are missing:\n", df_drop_all, "\n")

# ------------------------------------------
# 4️. Handle Missing Values – Imputation
# ------------------------------------------

# Fill with constant value
df_const = df.copy()
df_const['City'].fillna('Unknown', inplace=True)
print("After filling City with constant value:\n", df_const, "\n")

# Fill with mean, median, and mode
df_mean = df.copy()
df_mean['Marks'].fillna(df_mean['Marks'].mean(), inplace=True)
print("After filling Marks with mean:\n", df_mean, "\n")

df_median = df.copy()
df_median['Marks'].fillna(df_median['Marks'].median(), inplace=True)
print("After filling Marks with median:\n", df_median, "\n")

df_mode = df.copy()
df_mode['City'].fillna(df_mode['City'].mode()[0], inplace=True)
print("After filling City with mode:\n", df_mode, "\n")

# Forward Fill (previous value)
df_ffill = df.fillna(method='ffill')
print("After forward fill:\n", df_ffill, "\n")

# Backward Fill (next value)
df_bfill = df.fillna(method='bfill')
print("After backward fill:\n", df_bfill, "\n")

# ------------------------------------------
# 5️. Summary of Methods
# ------------------------------------------
"""
Identification:
    df.isnull(), df.notnull(), df.isnull().sum(), df.info()

Deletion:
    df.dropna(), df.dropna(axis=1), df.dropna(how='all'), df.dropna(subset=['col'])

Imputation:
    df.fillna(value)
    df['col'].fillna(df['col'].mean()/median()/mode()[0])
    df.fillna(method='ffill' or 'bfill')
"""

print(" All missing value handling methods demonstrated successfully.")

Original DataFrame:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric    NaN     Mumbai
2           3     Amit   75.0       None
3           4      NaN   90.0       Pune
4           5  Saranya    NaN  Hyderabad

Check missing values using isnull():
    Student_id   Name  Marks   City
0       False  False  False  False
1       False  False   True  False
2       False  False  False   True
3       False   True  False  False
4       False  False   True  False

Count of missing values in each column:
 Student_id    0
Name          1
Marks         2
City          1
dtype: int64

Non-null info summary:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_id  5 non-null      int64
 1   Name        4 non-null      object
 2   Marks       3 non-null      float64
 3   City        4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes


After dropping rows with missing values:
    Student_id Name  Marks   City
0           1  Jay   85.0  Delhi

After dropping columns with missing values:
    Student_id
0           1
1           2
2           3
3           4
4           5

After dropping rows where all values are missing:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric    NaN     Mumbai
2           3     Amit   75.0       None
3           4      NaN   90.0       Pune
4           5  Saranya    NaN  Hyderabad

After filling City with constant value:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric    NaN     Mumbai
2           3     Amit   75.0    Unknown
3           4      NaN   90.0       Pune
4           5  Saranya    NaN  Hyderabad

After filling Marks with mean:
    Student_id     Name      Marks       City
0           1      Jay  85.000000      Delhi
1           2     Eric  83.333333     Mumbai
2           3     Amit  75.000000       None
3           4      NaN  90.000000       Pune
4           5  Saranya  83.333333  Hyderabad

After filling Marks with median:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric   85.0     Mumbai
2           3     Amit   75.0       None
3           4      NaN   90.0       Pune
4           5  Saranya   85.0  Hyderabad

After filling City with mode:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric    NaN     Mumbai
2           3     Amit   75.0      Delhi
3           4      NaN   90.0       Pune
4           5  Saranya    NaN  Hyderabad

After forward fill:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric   85.0     Mumbai
2           3     Amit   75.0     Mumbai
3           4     Amit   90.0       Pune
4           5  Saranya   90.0  Hyderabad

After backward fill:
    Student_id     Name  Marks       City
0           1      Jay   85.0      Delhi
1           2     Eric   75.0     Mumbai
2           3     Amit   75.0       Pune
3           4  Saranya   90.0       Pune
4           5  Saranya    NaN  Hyderabad

 All missing value handling methods demonstrated successfully.